--- a/docs/manual/object/ifs/Chain.md
+++ b/docs/manual/object/ifs/Chain.md
@@ -10,20 +10,17 @@ var chain = new mq.Chain([
 ```
 
 ## 继承关系
-```uml
-#lineWidth: 1.5
-#font: Helvetica,sans-Serif
-#fontSize: 10
-#leading: 1.6
-#.this: fill=lightgray
-#.class: fill=white
+```dot
+digraph {
+    node [fontname="Helvetica,sans-Serif", fontsize=10, shape="record", style="filled", fillcolor="white"];
 
-[<class>object|toString();toJSON()]
-[<class>Handler|new Handler()|invoke()]
-[<this>Chain|new Chain()|append()]
+    object [tooltip="object", URL="object.md", label="{object|toString()\ltoJSON()\l}"];
+    Handler [tooltip="Handler", URL="Handler.md", label="{Handler|new Handler()\l|invoke()\l}"];
+    Chain [tooltip="Chain", fillcolor="lightgray", id="me", label="{Chain|new Chain()\l|append()\l}"];
 
-[object] <:- [Handler]
-[Handler] <:- [Chain]
+    object -> Handler [dir=back];
+    Handler -> Chain [dir=back];
+}
 ```
 
 ## 构造函数
