--- a/docs/manual/object/ifs/HttpHandler.md
+++ b/docs/manual/object/ifs/HttpHandler.md
@@ -14,20 +14,17 @@ var hdlr = new http.Handler(...);
 ```
 
 ## 继承关系
-```uml
-#lineWidth: 1.5
-#font: Helvetica,sans-Serif
-#fontSize: 10
-#leading: 1.6
-#.this: fill=lightgray
-#.class: fill=white
+```dot
+digraph {
+    node [fontname="Helvetica,sans-Serif", fontsize=10, shape="record", style="filled", fillcolor="white"];
 
-[<class>object|toString();toJSON()]
-[<class>Handler|new Handler()|invoke()]
-[<this>HttpHandler|new HttpHandler()|maxHeadersCount;maxBodySize;enableEncoding;serverName;handler|enableCrossOrigin()]
+    object [tooltip="object", URL="object.md", label="{object|toString()\ltoJSON()\l}"];
+    Handler [tooltip="Handler", URL="Handler.md", label="{Handler|new Handler()\l|invoke()\l}"];
+    HttpHandler [tooltip="HttpHandler", fillcolor="lightgray", id="me", label="{HttpHandler|new HttpHandler()\l|maxHeadersCount\lmaxBodySize\lenableEncoding\lserverName\lhandler\l|enableCrossOrigin()\l}"];
 
-[object] <:- [Handler]
-[Handler] <:- [HttpHandler]
+    object -> Handler [dir=back];
+    Handler -> HttpHandler [dir=back];
+}
 ```
 
 ## 构造函数
