--- a/docs/manual/object/ifs/HttpServer.md
+++ b/docs/manual/object/ifs/HttpServer.md
@@ -19,22 +19,19 @@ var svr = new http.Server(80, function(req) {
 ```
 
 ## 继承关系
-```uml
-#lineWidth: 1.5
-#font: Helvetica,sans-Serif
-#fontSize: 10
-#leading: 1.6
-#.this: fill=lightgray
-#.class: fill=white
+```dot
+digraph {
+    node [fontname="Helvetica,sans-Serif", fontsize=10, shape="record", style="filled", fillcolor="white"];
 
-[<class>object|toString();toJSON()]
-[<class>TcpServer|new TcpServer()|socket;handler|start();stop()]
-[<this>HttpServer|new HttpServer()|maxHeadersCount;maxBodySize;enableEncoding;serverName|enableCrossOrigin()]
-[<class>HttpsServer]
+    object [tooltip="object", URL="object.md", label="{object|toString()\ltoJSON()\l}"];
+    TcpServer [tooltip="TcpServer", URL="TcpServer.md", label="{TcpServer|new TcpServer()\l|socket\lhandler\l|start()\lstop()\l}"];
+    HttpServer [tooltip="HttpServer", fillcolor="lightgray", id="me", label="{HttpServer|new HttpServer()\l|maxHeadersCount\lmaxBodySize\lenableEncoding\lserverName\l|enableCrossOrigin()\l}"];
+    HttpsServer [tooltip="HttpsServer", URL="HttpsServer.md", label="{HttpsServer}"];
 
-[object] <:- [TcpServer]
-[TcpServer] <:- [HttpServer]
-[HttpServer] <:- [HttpsServer]
+    object -> TcpServer [dir=back];
+    TcpServer -> HttpServer [dir=back];
+    HttpServer -> HttpsServer [dir=back];
+}
 ```
 
 ## 构造函数
