--- a/docs/manual/object/ifs/SslHandler.md
+++ b/docs/manual/object/ifs/SslHandler.md
@@ -14,20 +14,17 @@ function(s) {
 ```
 
 ## 继承关系
-```uml
-#lineWidth: 1.5
-#font: Helvetica,sans-Serif
-#fontSize: 10
-#leading: 1.6
-#.this: fill=lightgray
-#.class: fill=white
+```dot
+digraph {
+    node [fontname="Helvetica,sans-Serif", fontsize=10, shape="record", style="filled", fillcolor="white"];
 
-[<class>object|toString();toJSON()]
-[<class>Handler|new Handler()|invoke()]
-[<this>SslHandler|new SslHandler()|verification;ca;handler]
+    object [tooltip="object", URL="object.md", label="{object|toString()\ltoJSON()\l}"];
+    Handler [tooltip="Handler", URL="Handler.md", label="{Handler|new Handler()\l|invoke()\l}"];
+    SslHandler [tooltip="SslHandler", fillcolor="lightgray", id="me", label="{SslHandler|new SslHandler()\l|verification\lca\lhandler\l}"];
 
-[object] <:- [Handler]
-[Handler] <:- [SslHandler]
+    object -> Handler [dir=back];
+    Handler -> SslHandler [dir=back];
+}
 ```
 
 ## 构造函数
